{"cells":[{"metadata":{"id":"3dccd28d1e0a9d33"},"cell_type":"markdown","source":["# Medication Analysis via Neo4j\n"],"id":"3dccd28d1e0a9d33"},{"cell_type":"markdown","source":["\n","## Load data to Neo4j"],"metadata":{"id":"j8Z5XVfmdQNS"},"id":"j8Z5XVfmdQNS"},{"cell_type":"code","id":"initial_id","metadata":{"collapsed":true,"ExecuteTime":{"end_time":"2024-06-21T14:32:25.028942Z","start_time":"2024-06-21T14:32:22.716963Z"},"colab":{"base_uri":"https://localhost:8080/"},"id":"initial_id","executionInfo":{"status":"ok","timestamp":1718985236848,"user_tz":-120,"elapsed":18129,"user":{"displayName":"Julia Kiesel","userId":"06596080838090206346"}},"outputId":"dc14f9dd-96ab-42a2-c8d6-b9b0462eeaf4"},"source":["from neo4j import GraphDatabase, Query\n","from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n","\n","# Connect to your Neo4j instance\n","uri = \"neo4j+s://2121873f.databases.neo4j.io\"\n","driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"FRP5W8toH8feYqDBZPOUo8eojUsW4k8pfAKVH6yTVdQ\"))\n","\n","# Cypher query to load data to Neo4j\n","delete_data = Query(\"\"\"\n","//Delete All\n","MATCH (n)\n","DETACH DELETE n;\n","\"\"\")\n","\n","load_nodes = Query(\"\"\"\n","//Load All\n","LOAD CSV WITH HEADERS FROM \"https://docs.google.com/spreadsheets/d/1hCPlV7HiiYhy6MMnbzkPv0DRmFjJDe4lVdzR9NBnIKo/export?format=csv\" AS row\n","MERGE (n:Node {id: row.Name, class: row.Class, uri_class: row.URI_class, uri_root: row.URI_root, epa_label: row.epa_label});\"\"\")\n","\n","load_relationships = Query(\"\"\"\n","//Load Rels with Label\n","LOAD CSV WITH HEADERS FROM \"https://docs.google.com/spreadsheets/d/1PaYa9_Nlf-6FUPaOWpKJpg7gdlkTAQb2StwaeB5CSi0/export?format=csv\" AS row\n","MATCH (source:Node {id: row.Source_Node})\n","MATCH (target:Node {id: row.Target_Node})\n","// Create the relationship with dynamic type\n","CALL apoc.create.relationship(source, row.Pharmacists_Label, {name: row.Relationship, step: row.Step, subprocess: row.Subprocess}, target)\n","YIELD rel\n","RETURN rel;\n","\"\"\")\n","\n","# Execute the queries\n","with driver.session() as session:\n","    driver.verify_connectivity()\n","    print(\"Connection established.\")\n","    session.run(delete_data)\n","    session.run(load_nodes)\n","    session.run(load_relationships)\n","    print(f\"Data loaded successfully.\")"],"outputs":[{"output_type":"stream","name":"stdout","text":["Requirement already satisfied: neo4j in /usr/local/lib/python3.10/dist-packages (5.21.0)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2023.4)\n","Requirement already satisfied: yfiles_jupyter_graphs_for_neo4j in /usr/local/lib/python3.10/dist-packages (1.2.0)\n","Requirement already satisfied: yfiles-jupyter-graphs in /usr/local/lib/python3.10/dist-packages (from yfiles_jupyter_graphs_for_neo4j) (1.7.2)\n","Requirement already satisfied: ipywidgets>=8.0.0 in /usr/local/lib/python3.10/dist-packages (from yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (8.1.3)\n","Requirement already satisfied: comm>=0.1.3 in /usr/local/lib/python3.10/dist-packages (from ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.2.2)\n","Requirement already satisfied: ipython>=6.1.0 in /usr/local/lib/python3.10/dist-packages (from ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (7.34.0)\n","Requirement already satisfied: traitlets>=4.3.1 in /usr/local/lib/python3.10/dist-packages (from ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (5.7.1)\n","Requirement already satisfied: widgetsnbextension~=4.0.11 in /usr/local/lib/python3.10/dist-packages (from ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (4.0.11)\n","Requirement already satisfied: jupyterlab-widgets~=3.0.11 in /usr/local/lib/python3.10/dist-packages (from ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (3.0.11)\n","Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (67.7.2)\n","Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.19.1)\n","Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (4.4.2)\n","Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.7.5)\n","Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (3.0.47)\n","Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (2.16.1)\n","Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.2.0)\n","Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.1.7)\n","Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (4.9.0)\n","Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.8.4)\n","Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.7.0)\n","Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=6.1.0->ipywidgets>=8.0.0->yfiles-jupyter-graphs->yfiles_jupyter_graphs_for_neo4j) (0.2.13)\n","Connection established.\n","Data loaded successfully.\n"]}],"execution_count":14},{"metadata":{"id":"f9d7a07f9bafe3df"},"cell_type":"markdown","source":["## Group the data\n","- Group the data by classes\n","- Group the data by EPA\n","- Give classes EPA labels"],"id":"f9d7a07f9bafe3df"},{"metadata":{"ExecuteTime":{"end_time":"2024-06-21T14:50:37.869992Z","start_time":"2024-06-21T14:50:36.358635Z"},"colab":{"base_uri":"https://localhost:8080/","height":914},"id":"9519e0fb2031bc55","executionInfo":{"status":"ok","timestamp":1718985267773,"user_tz":-120,"elapsed":3482,"user":{"displayName":"Julia Kiesel","userId":"06596080838090206346"}},"outputId":"9015e6c4-8835-4294-f5cf-c49ca8838e2b"},"cell_type":"code","source":["# Group by class\n","label_class = Query(\"\"\"\n","MATCH (n)\n","WITH DISTINCT n.class AS class, collect(DISTINCT n) AS nodes\n","CALL apoc.create.addLabels(nodes, [apoc.text.upperCamelCase(class)]) YIELD node\n","RETURN *\n","\"\"\")\n","\n","# Group by EPA\n","label_epa = Query(\"\"\"\n","MATCH (n)\n","WITH DISTINCT n.epa_label AS label, collect(DISTINCT n) AS nodes\n","CALL apoc.create.addLabels(nodes, [apoc.text.upperCamelCase(label)]) YIELD node\n","RETURN *\n","\"\"\")\n","\n","# Give EPA label\n","give_epa_label = Query(\"\"\"\n","MATCH (n)\n","WHERE NOT(n.epa_label=\"nan\")\n","SET n:EPA\n","\"\"\")\n","\n","# Return Labels\n","return_labels = Query(\"\"\"\n","MATCH (n)\n","RETURN DISTINCT labels(n) AS labels, count(*) AS count\n","\"\"\")\n","\n","# Execute the queries\n","with driver.session() as session:\n","    session.run(label_class)\n","    session.run(label_epa)\n","    session.run(give_epa_label)\n","    result = session.run(return_labels)\n","    df = result.to_df()\n","    print(f\"Labels:\")\n","    display(df)"],"id":"9519e0fb2031bc55","outputs":[{"output_type":"stream","name":"stdout","text":["Labels:\n"]},{"output_type":"display_data","data":{"text/plain":["                                           labels  count\n","0                [Node, Medicationstatement, Nan]     27\n","1                               [Node, Time, Nan]      4\n","2                [Node, Condition, Anamnese, EPA]      7\n","3                              [Node, Other, Nan]     11\n","4                          [Node, Diagnosis, Nan]     21\n","5                          [Node, Attribute, Nan]     23\n","6      [Node, Diagnosis, AdmissionDiagnosis, EPA]      2\n","7                        [Node, Observation, Nan]     26\n","8                            [Node, Library, Nan]      8\n","9              [Node, Questionnaireresponse, Nan]      4\n","10                        [Node, Medication, Nan]     12\n","11                   [Node, Nutritionintake, Nan]      2\n","12                  [Node, Observation, Ekg, EPA]      3\n","13                  [Node, Processstatement, Nan]      2\n","14     [Node, Observation, LaboratoryValues, EPA]     18\n","15                        [Node, Medication, EPA]     10\n","16                             [Node, Group, Nan]      1\n","17                 [Node, Medicationrequest, Nan]      2\n","18                           [Node, Setting, Nan]      2\n","19       [Node, Patient, PatientInformation, EPA]      4\n","20                         [Node, Condition, Nan]      1\n","21           [Node, Observation, Sonography, EPA]      2\n","22                          [Node, Careplan, Nan]      1\n","23  [Node, Observation, ExaminationFindings, EPA]      6\n","24       [Node, Condition, FollowUpFindings, EPA]      2\n","25        [Node, Condition, PrelimDiagnosis, EPA]      4\n","26     [Node, Observation, CellCountInUrine, EPA]      4"],"text/html":["\n","  <div id=\"df-d04310c2-266c-46a7-a532-9f5693457df8\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>labels</th>\n","      <th>count</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>[Node, Medicationstatement, Nan]</td>\n","      <td>27</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>[Node, Time, Nan]</td>\n","      <td>4</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>[Node, Condition, Anamnese, EPA]</td>\n","      <td>7</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>[Node, Other, Nan]</td>\n","      <td>11</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>[Node, Diagnosis, Nan]</td>\n","      <td>21</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>[Node, Attribute, Nan]</td>\n","      <td>23</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>[Node, Diagnosis, AdmissionDiagnosis, EPA]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>[Node, Observation, Nan]</td>\n","      <td>26</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>[Node, Library, Nan]</td>\n","      <td>8</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>[Node, Questionnaireresponse, Nan]</td>\n","      <td>4</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>[Node, Medication, Nan]</td>\n","      <td>12</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>[Node, Nutritionintake, Nan]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>[Node, Observation, Ekg, EPA]</td>\n","      <td>3</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>[Node, Processstatement, Nan]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>[Node, Observation, LaboratoryValues, EPA]</td>\n","      <td>18</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>[Node, Medication, EPA]</td>\n","      <td>10</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>[Node, Group, Nan]</td>\n","      <td>1</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>[Node, Medicationrequest, Nan]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>[Node, Setting, Nan]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>[Node, Patient, PatientInformation, EPA]</td>\n","      <td>4</td>\n","    </tr>\n","    <tr>\n","      <th>20</th>\n","      <td>[Node, Condition, Nan]</td>\n","      <td>1</td>\n","    </tr>\n","    <tr>\n","      <th>21</th>\n","      <td>[Node, Observation, Sonography, EPA]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>22</th>\n","      <td>[Node, Careplan, Nan]</td>\n","      <td>1</td>\n","    </tr>\n","    <tr>\n","      <th>23</th>\n","      <td>[Node, Observation, ExaminationFindings, EPA]</td>\n","      <td>6</td>\n","    </tr>\n","    <tr>\n","      <th>24</th>\n","      <td>[Node, Condition, FollowUpFindings, EPA]</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>25</th>\n","      <td>[Node, Condition, PrelimDiagnosis, EPA]</td>\n","      <td>4</td>\n","    </tr>\n","    <tr>\n","      <th>26</th>\n","      <td>[Node, Observation, CellCountInUrine, EPA]</td>\n","      <td>4</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-d04310c2-266c-46a7-a532-9f5693457df8')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-d04310c2-266c-46a7-a532-9f5693457df8 button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-d04310c2-266c-46a7-a532-9f5693457df8');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","<div id=\"df-f18d52e3-6f3d-4c2d-9882-84d052b46872\">\n","  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-f18d52e3-6f3d-4c2d-9882-84d052b46872')\"\n","            title=\"Suggest charts\"\n","            style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","  </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","  <script>\n","    async function quickchart(key) {\n","      const quickchartButtonEl =\n","        document.querySelector('#' + key + ' button');\n","      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","      quickchartButtonEl.classList.add('colab-df-spinner');\n","      try {\n","        const charts = await google.colab.kernel.invokeFunction(\n","            'suggestCharts', [key], {});\n","      } catch (error) {\n","        console.error('Error during call to suggestCharts:', error);\n","      }\n","      quickchartButtonEl.classList.remove('colab-df-spinner');\n","      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","    }\n","    (() => {\n","      let quickchartButtonEl =\n","        document.querySelector('#df-f18d52e3-6f3d-4c2d-9882-84d052b46872 button');\n","      quickchartButtonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","    })();\n","  </script>\n","</div>\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","variable_name":"df","summary":"{\n  \"name\": \"df\",\n  \"rows\": 27,\n  \"fields\": [\n    {\n      \"column\": \"labels\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"count\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 8,\n        \"min\": 1,\n        \"max\": 27,\n        \"num_unique_values\": 15,\n        \"samples\": [\n          12,\n          18,\n          27\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{}}],"execution_count":15},{"metadata":{"id":"fd1d81368a892299"},"cell_type":"markdown","source":["## Display and explore Graph with yFiles"],"id":"fd1d81368a892299"},{"metadata":{"ExecuteTime":{"end_time":"2024-06-21T15:27:50.450955Z","start_time":"2024-06-21T15:27:50.046305Z"},"colab":{"base_uri":"https://localhost:8080/","height":727,"referenced_widgets":["9f63cb6331e947d290e5f0f4b994f94d","4e3772ae71fd4764a676eb6a5dbef286"]},"id":"d3d144da13058bfc","executionInfo":{"status":"ok","timestamp":1718985439191,"user_tz":-120,"elapsed":815,"user":{"displayName":"Julia Kiesel","userId":"06596080838090206346"}},"outputId":"c3c09691-7b5d-464e-8c31-3968aaf55d5d"},"cell_type":"code","source":["from google.colab import output\n","output.enable_custom_widget_manager()\n","\n","from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n","display_subprocess = Query(\"\"\"\n","MATCH (n)-[r]->(m)\n","WHERE r.subprocess= \"10\"\n","RETURN n, r, m\n","\"\"\")\n","\n","g = Neo4jGraphWidget(driver)\n","g.show_cypher(display_subprocess)"],"id":"d3d144da13058bfc","outputs":[{"output_type":"display_data","data":{"text/plain":["GraphWidget(layout=Layout(height='710px', width='100%'))"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"9f63cb6331e947d290e5f0f4b994f94d"}},"metadata":{"application/vnd.jupyter.widget-view+json":{"colab":{"custom_widget_manager":{"url":"https://ssl.gstatic.com/colaboratory-static/widgets/colab-cdn-widget-manager/2b70e893a8ba7c0f/manager.min.js"}}}}}],"execution_count":16},{"cell_type":"markdown","source":["## Evaluation:\n","\n"],"metadata":{"id":"gapreNm4iOb3"},"id":"gapreNm4iOb3"},{"cell_type":"markdown","source":["### Total Relationships per Node\n","set as new Property!"],"metadata":{"id":"JDWRzynQ9fYJ"},"id":"JDWRzynQ9fYJ"},{"cell_type":"code","source":["total_rels_per_node = Query(\"\"\"\n","MATCH (n)\n","OPTIONAL MATCH (n)-[r]-()\n","WITH n, COUNT(r) AS totalRelationships\n","SET n.relsCount = totalRelationships\n","RETURN n.id, n.epa_label, totalRelationships\n","ORDER BY n.epa_label, totalRelationships DESCENDING\n","\"\"\")\n","\n","with driver.session() as session:\n","    result = session.run(total_rels_per_node)\n","    #df1 = result.to_df()\n","    #display(df1)\n","\n","# Fügt Property zu jedem Knoten hinzu: Pharm_X_Count, usw. die zählt wie häufig hier die Relationships ein und ausgehen\n","for count in range (1,6):\n","  Pharm_rels_per_node = Query(f\"\"\"\n","  MATCH (a)\n","  OPTIONAL MATCH (a)-[r:Pharmacist_{count}]-()\n","  WITH a, COUNT(r) AS Pharm_{count}_Rels\n","  SET a.pharm_{count}_rels = Pharm_{count}_Rels\n","  RETURN a.id, a.epa_label, Pharm_{count}_Rels\n","  ORDER BY a.epa_label, Pharm_{count}_Rels DESC\n","  \"\"\")\n","\n","  # Execute the queries\n","  with driver.session() as session:\n","      result = session.run(Pharm_rels_per_node)\n","\n","display_rels = Query(f\"\"\"\n","  MATCH (a)\n","  RETURN a.id, a.epa_label AS label, a.relsCount AS totalRels, a.pharm_1_rels, a.pharm_2_rels, a.pharm_3_rels, a.pharm_4_rels, a.pharm_5_rels\n","  ORDER BY label, totalRels DESC\n","  \"\"\")\n","\n","with driver.session() as session:\n","    result = session.run(display_rels)\n","    df2 = result.to_df()\n","    display(df2)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":687},"id":"pghMPj1liX6n","executionInfo":{"status":"ok","timestamp":1718992773437,"user_tz":-120,"elapsed":1948,"user":{"displayName":"Julia Kiesel","userId":"06596080838090206346"}},"outputId":"c07ebec9-fc1f-4e22-ac13-7254356f06e5"},"id":"pghMPj1liX6n","execution_count":68,"outputs":[{"output_type":"display_data","data":{"text/plain":["      a.id             label  totalRels  a.pharm_1_rels  a.pharm_2_rels  \\\n","0       A0          Anamnese         36               2               2   \n","1       A1          Anamnese         12               4               2   \n","2       A2          Anamnese         11               2               3   \n","3       A3          Anamnese          4               0               0   \n","4       A6          Anamnese          2               0               0   \n","..     ...               ...        ...             ...             ...   \n","204    VD0  prelim_diagnosis         23               4               2   \n","205  VD2.2  prelim_diagnosis          9               2               0   \n","206  VD2.1  prelim_diagnosis          2               0               0   \n","207     S0        sonography          4               2               2   \n","208     S7        sonography          4               0               4   \n","\n","     a.pharm_3_rels  a.pharm_4_rels  a.pharm_5_rels  \n","0                18               4              10  \n","1                 4               0               2  \n","2                 4               0               2  \n","3                 0               0               4  \n","4                 0               2               0  \n","..              ...             ...             ...  \n","204               7               2               8  \n","205               0               0               7  \n","206               0               0               2  \n","207               0               0               0  \n","208               0               0               0  \n","\n","[209 rows x 8 columns]"],"text/html":["\n","  <div id=\"df-927fb3d7-3cfa-4211-bedf-6da88bc7fb26\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>a.id</th>\n","      <th>label</th>\n","      <th>totalRels</th>\n","      <th>a.pharm_1_rels</th>\n","      <th>a.pharm_2_rels</th>\n","      <th>a.pharm_3_rels</th>\n","      <th>a.pharm_4_rels</th>\n","      <th>a.pharm_5_rels</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>A0</td>\n","      <td>Anamnese</td>\n","      <td>36</td>\n","      <td>2</td>\n","      <td>2</td>\n","      <td>18</td>\n","      <td>4</td>\n","      <td>10</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>A1</td>\n","      <td>Anamnese</td>\n","      <td>12</td>\n","      <td>4</td>\n","      <td>2</td>\n","      <td>4</td>\n","      <td>0</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>A2</td>\n","      <td>Anamnese</td>\n","      <td>11</td>\n","      <td>2</td>\n","      <td>3</td>\n","      <td>4</td>\n","      <td>0</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>A3</td>\n","      <td>Anamnese</td>\n","      <td>4</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>4</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>A6</td>\n","      <td>Anamnese</td>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>2</td>\n","      <td>0</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>204</th>\n","      <td>VD0</td>\n","      <td>prelim_diagnosis</td>\n","      <td>23</td>\n","      <td>4</td>\n","      <td>2</td>\n","      <td>7</td>\n","      <td>2</td>\n","      <td>8</td>\n","    </tr>\n","    <tr>\n","      <th>205</th>\n","      <td>VD2.2</td>\n","      <td>prelim_diagnosis</td>\n","      <td>9</td>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>7</td>\n","    </tr>\n","    <tr>\n","      <th>206</th>\n","      <td>VD2.1</td>\n","      <td>prelim_diagnosis</td>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>207</th>\n","      <td>S0</td>\n","      <td>sonography</td>\n","      <td>4</td>\n","      <td>2</td>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","    <tr>\n","      <th>208</th>\n","      <td>S7</td>\n","      <td>sonography</td>\n","      <td>4</td>\n","      <td>0</td>\n","      <td>4</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>209 rows × 8 columns</p>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-927fb3d7-3cfa-4211-bedf-6da88bc7fb26')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-927fb3d7-3cfa-4211-bedf-6da88bc7fb26 button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-927fb3d7-3cfa-4211-bedf-6da88bc7fb26');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","<div id=\"df-7958d393-566d-4ab6-8e45-d875d75feb2b\">\n","  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-7958d393-566d-4ab6-8e45-d875d75feb2b')\"\n","            title=\"Suggest charts\"\n","            style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","  </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","  <script>\n","    async function quickchart(key) {\n","      const quickchartButtonEl =\n","        document.querySelector('#' + key + ' button');\n","      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","      quickchartButtonEl.classList.add('colab-df-spinner');\n","      try {\n","        const charts = await google.colab.kernel.invokeFunction(\n","            'suggestCharts', [key], {});\n","      } catch (error) {\n","        console.error('Error during call to suggestCharts:', error);\n","      }\n","      quickchartButtonEl.classList.remove('colab-df-spinner');\n","      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","    }\n","    (() => {\n","      let quickchartButtonEl =\n","        document.querySelector('#df-7958d393-566d-4ab6-8e45-d875d75feb2b button');\n","      quickchartButtonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","    })();\n","  </script>\n","</div>\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","variable_name":"df2","summary":"{\n  \"name\": \"df2\",\n  \"rows\": 209,\n  \"fields\": [\n    {\n      \"column\": \"a.id\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 209,\n        \"samples\": [\n          \"L13\",\n          \"medication_change\",\n          \"active\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"label\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 12,\n        \"samples\": [\n          \"prelim_diagnosis\",\n          \"patient_information\",\n          \"Anamnese\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 25,\n        \"min\": 0,\n        \"max\": 245,\n        \"num_unique_values\": 38,\n        \"samples\": [\n          9,\n          3,\n          2\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"a.pharm_1_rels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 4,\n        \"min\": 0,\n        \"max\": 35,\n        \"num_unique_values\": 12,\n        \"samples\": [\n          13,\n          18,\n          2\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"a.pharm_2_rels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 5,\n        \"min\": 0,\n        \"max\": 49,\n        \"num_unique_values\": 14,\n        \"samples\": [\n          49,\n          9,\n          2\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"a.pharm_3_rels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 5,\n        \"min\": 0,\n        \"max\": 50,\n        \"num_unique_values\": 16,\n        \"samples\": [\n          18,\n          4,\n          7\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"a.pharm_4_rels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 5,\n        \"min\": 0,\n        \"max\": 50,\n        \"num_unique_values\": 17,\n        \"samples\": [\n          4,\n          0,\n          5\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"a.pharm_5_rels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 7,\n        \"min\": 0,\n        \"max\": 70,\n        \"num_unique_values\": 17,\n        \"samples\": [\n          10,\n          2,\n          3\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{}}]},{"cell_type":"markdown","source":["###  How many times per Pharmacist: EPA labels - Laboratory Values, Medication, etc.\n"],"metadata":{"id":"kBcD16vNrxPD"},"id":"kBcD16vNrxPD"},{"cell_type":"code","source":["\n","display_rels_per_epa_class = Query(f\"\"\"\n","  MATCH (a)\n","  WITH a.epa_label AS label, SUM(a.totalRelationshipCount) as totalRels, SUM(a.Pharm_1_Rels) AS totalRels_1, SUM(a.Pharm_2_Rels) AS totalRels_2,SUM(a.Pharm_3_Rels) AS totalRels_3,SUM(a.Pharm_4_Rels) AS totalRels_4,SUM(a.Pharm_5_Rels) AS totalRels_5\n","  RETURN label, totalRels, totalRels_1, totalRels_2, totalRels_3, totalRels_4, totalRels_5\n","  ORDER BY label, totalRels DESC\n","  \"\"\")\n","\n","with driver.session() as session:\n","    result = session.run(display_rels_per_epa_class)\n","    df1 = result.to_df()\n","    display(df1)\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":426},"id":"MP85BY_bryxP","executionInfo":{"status":"ok","timestamp":1718992166839,"user_tz":-120,"elapsed":638,"user":{"displayName":"Julia Kiesel","userId":"06596080838090206346"}},"outputId":"eefa6dc7-c581-478f-94f0-f36cb7c376af"},"id":"MP85BY_bryxP","execution_count":59,"outputs":[{"output_type":"display_data","data":{"text/plain":["                   label  totalRels  totalRels_1  totalRels_2  totalRels_3  \\\n","0               Anamnese         69            8            7           30   \n","1    admission_diagnosis         41            8            2            8   \n","2    cell_count_in_urine         35           15            2            4   \n","3                    ekg         18            8            2            0   \n","4   examination_findings         21            4            4            6   \n","5     follow-up_findings         27            0            4            7   \n","6      laboratory_values        189           19           20           37   \n","7             medication        362           59           93           67   \n","8                    nan       1422          205          280          286   \n","9    patient_information         35            2            0            4   \n","10      prelim_diagnosis         71           12            6           15   \n","11            sonography          8            2            6            0   \n","\n","    totalRels_4  totalRels_5  \n","0             6           18  \n","1             6           17  \n","2             7            7  \n","3             0            8  \n","4             2            5  \n","5            10            6  \n","6            50           63  \n","7            61           82  \n","8           247          404  \n","9            13           16  \n","10           11           27  \n","11            0            0  "],"text/html":["\n","  <div id=\"df-60162f9b-9917-4448-800a-7a1b0b795bed\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>label</th>\n","      <th>totalRels</th>\n","      <th>totalRels_1</th>\n","      <th>totalRels_2</th>\n","      <th>totalRels_3</th>\n","      <th>totalRels_4</th>\n","      <th>totalRels_5</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Anamnese</td>\n","      <td>69</td>\n","      <td>8</td>\n","      <td>7</td>\n","      <td>30</td>\n","      <td>6</td>\n","      <td>18</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>admission_diagnosis</td>\n","      <td>41</td>\n","      <td>8</td>\n","      <td>2</td>\n","      <td>8</td>\n","      <td>6</td>\n","      <td>17</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>cell_count_in_urine</td>\n","      <td>35</td>\n","      <td>15</td>\n","      <td>2</td>\n","      <td>4</td>\n","      <td>7</td>\n","      <td>7</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>ekg</td>\n","      <td>18</td>\n","      <td>8</td>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>8</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>examination_findings</td>\n","      <td>21</td>\n","      <td>4</td>\n","      <td>4</td>\n","      <td>6</td>\n","      <td>2</td>\n","      <td>5</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>follow-up_findings</td>\n","      <td>27</td>\n","      <td>0</td>\n","      <td>4</td>\n","      <td>7</td>\n","      <td>10</td>\n","      <td>6</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>laboratory_values</td>\n","      <td>189</td>\n","      <td>19</td>\n","      <td>20</td>\n","      <td>37</td>\n","      <td>50</td>\n","      <td>63</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>medication</td>\n","      <td>362</td>\n","      <td>59</td>\n","      <td>93</td>\n","      <td>67</td>\n","      <td>61</td>\n","      <td>82</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>nan</td>\n","      <td>1422</td>\n","      <td>205</td>\n","      <td>280</td>\n","      <td>286</td>\n","      <td>247</td>\n","      <td>404</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>patient_information</td>\n","      <td>35</td>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>4</td>\n","      <td>13</td>\n","      <td>16</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>prelim_diagnosis</td>\n","      <td>71</td>\n","      <td>12</td>\n","      <td>6</td>\n","      <td>15</td>\n","      <td>11</td>\n","      <td>27</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>sonography</td>\n","      <td>8</td>\n","      <td>2</td>\n","      <td>6</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-60162f9b-9917-4448-800a-7a1b0b795bed')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-60162f9b-9917-4448-800a-7a1b0b795bed button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-60162f9b-9917-4448-800a-7a1b0b795bed');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","<div id=\"df-e3cfed70-76f0-4376-ac3e-3fb3d435f9a6\">\n","  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-e3cfed70-76f0-4376-ac3e-3fb3d435f9a6')\"\n","            title=\"Suggest charts\"\n","            style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","  </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","  <script>\n","    async function quickchart(key) {\n","      const quickchartButtonEl =\n","        document.querySelector('#' + key + ' button');\n","      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","      quickchartButtonEl.classList.add('colab-df-spinner');\n","      try {\n","        const charts = await google.colab.kernel.invokeFunction(\n","            'suggestCharts', [key], {});\n","      } catch (error) {\n","        console.error('Error during call to suggestCharts:', error);\n","      }\n","      quickchartButtonEl.classList.remove('colab-df-spinner');\n","      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","    }\n","    (() => {\n","      let quickchartButtonEl =\n","        document.querySelector('#df-e3cfed70-76f0-4376-ac3e-3fb3d435f9a6 button');\n","      quickchartButtonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","    })();\n","  </script>\n","</div>\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","variable_name":"df1","summary":"{\n  \"name\": \"df1\",\n  \"rows\": 12,\n  \"fields\": [\n    {\n      \"column\": \"label\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 12,\n        \"samples\": [\n          \"prelim_diagnosis\",\n          \"patient_information\",\n          \"Anamnese\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 400,\n        \"min\": 8,\n        \"max\": 1422,\n        \"num_unique_values\": 11,\n        \"samples\": [\n          27,\n          69,\n          71\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels_1\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 57,\n        \"min\": 0,\n        \"max\": 205,\n        \"num_unique_values\": 9,\n        \"samples\": [\n          2,\n          15,\n          59\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels_2\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 81,\n        \"min\": 0,\n        \"max\": 280,\n        \"num_unique_values\": 8,\n        \"samples\": [\n          2,\n          280,\n          7\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels_3\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 80,\n        \"min\": 0,\n        \"max\": 286,\n        \"num_unique_values\": 10,\n        \"samples\": [\n          286,\n          8,\n          7\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels_4\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 69,\n        \"min\": 0,\n        \"max\": 247,\n        \"num_unique_values\": 10,\n        \"samples\": [\n          13,\n          7,\n          50\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"totalRels_5\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 112,\n        \"min\": 0,\n        \"max\": 404,\n        \"num_unique_values\": 12,\n        \"samples\": [\n          27,\n          16,\n          18\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{}}]},{"cell_type":"markdown","source":["### How many times per Pharmacist: Issues like needsRequest, needsClarification, needs"],"metadata":{"id":"C49Bbnc493fU"},"id":"C49Bbnc493fU"},{"cell_type":"code","source":[],"metadata":{"id":"LkMF6iEH99G6"},"id":"LkMF6iEH99G6","execution_count":null,"outputs":[]}],"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":2},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython2","version":"2.7.6"},"colab":{"provenance":[]},"widgets":{"application/vnd.jupyter.widget-state+json":{"9f63cb6331e947d290e5f0f4b994f94d":{"model_module":"yfiles-jupyter-graphs","model_name":"GraphModel","model_module_version":"^1.7.2","state":{"_context_pane_mapping":[{"id":"Neighborhood","title":"Neighborhood"},{"id":"Data","title":"Data"},{"id":"Search","title":"Search"},{"id":"About","title":"About"}],"_data_importer":"neo4j","_directed":true,"_dom_classes":[],"_edges":[{"id":1161938599466238000,"start":29,"end":165,"properties":{"name":"needsClarificationOf","step":"5","subprocess":"10","label":"Pharmacist_5"},"label":"needsClarificationOf","color":"#9E9E9E","thickness_factor":1,"directed":true},{"id":1166442199093608400,"start":44,"end":68,"properties":{"name":"is","step":"7","subprocess":"10","label":"Pharmacist_5"},"label":"is","color":"#9E9E9E","thickness_factor":1,"directed":true},{"id":1152928101676613600,"start":53,"end":68,"properties":{"name":"is","step":"8","subprocess":"10","label":"Pharmacist_2"},"label":"is","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1152927002164985900,"start":55,"end":56,"properties":{"name":"needsClarificationOf","step":"4","subprocess":"10","label":"Pharmacist_1"},"label":"needsClarificationOf","color":"#2196F3","thickness_factor":1,"directed":true},{"id":1152927002164985900,"start":56,"end":68,"properties":{"name":"is","step":"5","subprocess":"10","label":"Pharmacist_1"},"label":"is","color":"#2196F3","thickness_factor":1,"directed":true},{"id":1152931400211497000,"start":65,"end":74,"properties":{"name":"is","step":"3","subprocess":"10","label":"Pharmacist_5"},"label":"is","color":"#9E9E9E","thickness_factor":1,"directed":true},{"id":6924294322686788000,"start":74,"end":29,"properties":{"name":"combinedWith","step":"4","subprocess":"10","label":"Pharmacist_5"},"label":"combinedWith","color":"#9E9E9E","thickness_factor":1,"directed":true},{"id":1152928101676613600,"start":86,"end":99,"properties":{"name":"giveAttentionTo","step":"3","subprocess":"10","label":"Pharmacist_2"},"label":"giveAttentionTo","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1152930300699869200,"start":91,"end":131,"properties":{"name":"is","step":"3","subprocess":"10","label":"Pharmacist_4"},"label":"is","color":"#4CAF50","thickness_factor":1,"directed":true},{"id":1152928101676613600,"start":99,"end":157,"properties":{"name":"is","step":"4","subprocess":"10","label":"Pharmacist_2"},"label":"is","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1155178801978671000,"start":114,"end":55,"properties":{"name":"hasIndication","step":"3","subprocess":"10","label":"Pharmacist_1"},"label":"hasIndication","color":"#2196F3","thickness_factor":1,"directed":true},{"id":6924293223175160000,"start":131,"end":139,"properties":{"name":"hasOutcome","step":"4","subprocess":"10","label":"Pharmacist_4"},"label":"hasOutcome","color":"#4CAF50","thickness_factor":1,"directed":true},{"id":1161937499954610400,"start":139,"end":68,"properties":{"name":"is","step":"5","subprocess":"10","label":"Pharmacist_4"},"label":"is","color":"#4CAF50","thickness_factor":1,"directed":true},{"id":1152929201188241700,"start":139,"end":68,"properties":{"name":"is","step":"5","subprocess":"10","label":"Pharmacist_3"},"label":"is","color":"#F44336","thickness_factor":1,"directed":true},{"id":1152929201188241700,"start":143,"end":139,"properties":{"name":"hasOutcome","step":"4","subprocess":"10","label":"Pharmacist_3"},"label":"hasOutcome","color":"#F44336","thickness_factor":1,"directed":true},{"id":1152928101676614000,"start":157,"end":53,"properties":{"name":"needsRequestOf","step":"5","subprocess":"10","label":"Pharmacist_2"},"label":"needsRequestOf","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1155179901490299100,"start":157,"end":169,"properties":{"name":"needsRequestOf","step":"6","subprocess":"10","label":"Pharmacist_2"},"label":"needsRequestOf","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1157431701303984400,"start":157,"end":204,"properties":{"name":"needsRequestOf","step":"7","subprocess":"10","label":"Pharmacist_2"},"label":"needsRequestOf","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":6928797922314158000,"start":165,"end":44,"properties":{"name":"needsRequestOf","step":"6","subprocess":"10","label":"Pharmacist_5"},"label":"needsRequestOf","color":"#9E9E9E","thickness_factor":1,"directed":true},{"id":1152929201188241700,"start":166,"end":143,"properties":{"name":"is","step":"3","subprocess":"10","label":"Pharmacist_3"},"label":"is","color":"#F44336","thickness_factor":1,"directed":true},{"id":1152928101676614000,"start":169,"end":68,"properties":{"name":"is","step":"8","subprocess":"10","label":"Pharmacist_2"},"label":"is","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1173193200488153300,"start":171,"end":114,"properties":{"name":"is","step":"1","subprocess":"10","label":"Pharmacist_1"},"label":"is","color":"#2196F3","thickness_factor":1,"directed":true},{"id":1173194299999781000,"start":171,"end":86,"properties":{"name":"is","step":"1","subprocess":"10","label":"Pharmacist_2"},"label":"is","color":"#9C27B0","thickness_factor":1,"directed":true},{"id":1173195399511409000,"start":171,"end":166,"properties":{"name":"is","step":"1","subprocess":"10","label":"Pharmacist_3"},"label":"is","color":"#F44336","thickness_factor":1,"directed":true},{"id":1182203698277777700,"start":171,"end":91,"properties":{"name":"is","step":"1","subprocess":"10","label":"Pharmacist_4"},"label":"is","color":"#4CAF50","thickness_factor":1,"directed":true},{"id":1173197598534664400,"start":171,"end":65,"properties":{"name":"is","step":"1","subprocess":"10","label":"Pharmacist_5"},"label":"is","color":"#9E9E9E","thickness_factor":1,"directed":true},{"id":1152928101676614000,"start":204,"end":68,"properties":{"name":"is","step":"8","subprocess":"10","label":"Pharmacist_2"},"label":"is","color":"#9C27B0","thickness_factor":1,"directed":true}],"_graph_layout":{},"_highlight":[],"_license":{},"_model_module":"yfiles-jupyter-graphs","_model_module_version":"^1.7.2","_model_name":"GraphModel","_neighborhood":{},"_nodes":[{"id":29,"properties":{"epa_label":"admission_diagnosis","uri_class":"diagnosis","uri_root":"nan/","id":"AD1","class":"diagnosis","label":"Diagnosis:EPA:Node:AdmissionDiagnosis"},"color":"#2196F3","styles":{},"label":"Diagnosis:EPA:Node:AdmissionDiagnosis","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":165,"properties":{"epa_label":"nan","uri_class":"diagnosis","uri_root":"nan/","id":"sepsis","class":"diagnosis","label":"Diagnosis:Nan:Node"},"color":"#4CAF50","styles":{},"label":"Diagnosis:Nan:Node","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":44,"properties":{"epa_label":"nan","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"blood_pressure","class":"Observation","label":"Observation:Nan:Node"},"color":"#F44336","styles":{},"label":"Observation:Nan:Node","scale_factor":1,"type":"#F44336","size":[55,55],"position":[0,0]},{"id":68,"properties":{"epa_label":"nan","uri_class":"ProcessStatement","uri_root":"nan/","id":"end","class":"ProcessStatement","label":"Processstatement:Nan:Node"},"color":"#607D8B","styles":{},"label":"Processstatement:Nan:Node","scale_factor":1,"type":"#607D8B","size":[55,55],"position":[0,0]},{"id":53,"properties":{"epa_label":"nan","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"creatinin","class":"Observation","label":"Observation:Nan:Node"},"color":"#F44336","styles":{},"label":"Observation:Nan:Node","scale_factor":1,"type":"#F44336","size":[55,55],"position":[0,0]},{"id":55,"properties":{"epa_label":"nan","uri_class":"E10-E14.html","uri_root":"https://www.icd-code.de/icd/code/","id":"diabetes","class":"diagnosis","label":"Diagnosis:Nan:Node"},"color":"#4CAF50","styles":{},"label":"Diagnosis:Nan:Node","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":56,"properties":{"epa_label":"nan","uri_class":"diagnosis","uri_root":"nan/","id":"diagnosis","class":"diagnosis","label":"Diagnosis:Nan:Node"},"color":"#4CAF50","styles":{},"label":"Diagnosis:Nan:Node","scale_factor":1,"type":"#4CAF50","size":[55,55],"position":[0,0]},{"id":65,"properties":{"epa_label":"ekg","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"E2","class":"Observation","label":"Observation:Ekg:Node:EPA"},"color":"#673AB7","styles":{},"label":"Observation:Ekg:Node:EPA","scale_factor":1,"type":"#673AB7","size":[55,55],"position":[0,0]},{"id":74,"properties":{"epa_label":"nan","uri_class":"Attribute","uri_root":"nan/","id":"high","class":"Attribute","label":"Attribute:Nan:Node"},"color":"#CDDC39","styles":{},"label":"Attribute:Nan:Node","scale_factor":1,"type":"#CDDC39","size":[55,55],"position":[0,0]},{"id":86,"properties":{"epa_label":"laboratory_values","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"L0","class":"Observation","label":"LaboratoryValues:Observation:Node:EPA"},"color":"#9E9E9E","styles":{},"label":"LaboratoryValues:Observation:Node:EPA","scale_factor":1,"type":"#9E9E9E","size":[55,55],"position":[0,0]},{"id":99,"properties":{"epa_label":"laboratory_values","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"L4","class":"Observation","label":"LaboratoryValues:Observation:Node:EPA"},"color":"#9E9E9E","styles":{},"label":"LaboratoryValues:Observation:Node:EPA","scale_factor":1,"type":"#9E9E9E","size":[55,55],"position":[0,0]},{"id":91,"properties":{"epa_label":"laboratory_values","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"L14","class":"Observation","label":"LaboratoryValues:Observation:Node:EPA"},"color":"#9E9E9E","styles":{},"label":"LaboratoryValues:Observation:Node:EPA","scale_factor":1,"type":"#9E9E9E","size":[55,55],"position":[0,0]},{"id":131,"properties":{"epa_label":"nan","uri_class":"Attribute","uri_root":"nan/","id":"normal","class":"Attribute","label":"Attribute:Nan:Node"},"color":"#CDDC39","styles":{},"label":"Attribute:Nan:Node","scale_factor":1,"type":"#CDDC39","size":[55,55],"position":[0,0]},{"id":157,"properties":{"epa_label":"nan","uri_class":"Attribute","uri_root":"nan/","id":"related_to_1.73qm","class":"Attribute","label":"Attribute:Nan:Node"},"color":"#CDDC39","styles":{},"label":"Attribute:Nan:Node","scale_factor":1,"type":"#CDDC39","size":[55,55],"position":[0,0]},{"id":114,"properties":{"epa_label":"medication","uri_class":"medication.html","uri_root":"https://build.fhir.org/","id":"M1","class":"Medication","label":"Medication:EPA:Node"},"color":"#9C27B0","styles":{},"label":"Medication:EPA:Node","scale_factor":1,"type":"#9C27B0","size":[55,55],"position":[0,0]},{"id":139,"properties":{"epa_label":"nan","uri_class":"Attribute","uri_root":"nan/","id":"okay","class":"Attribute","label":"Attribute:Nan:Node"},"color":"#CDDC39","styles":{},"label":"Attribute:Nan:Node","scale_factor":1,"type":"#CDDC39","size":[55,55],"position":[0,0]},{"id":143,"properties":{"epa_label":"nan","uri_class":"Setting","uri_root":"nan/","id":"outpatient_renal_clinic","class":"Setting","label":"Setting:Nan:Node"},"color":"#2196F3","styles":{},"label":"Setting:Nan:Node","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":169,"properties":{"epa_label":"nan","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"size","class":"Observation","label":"Observation:Nan:Node"},"color":"#F44336","styles":{},"label":"Observation:Nan:Node","scale_factor":1,"type":"#F44336","size":[55,55],"position":[0,0]},{"id":204,"properties":{"epa_label":"nan","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"weight","class":"Observation","label":"Observation:Nan:Node"},"color":"#F44336","styles":{},"label":"Observation:Nan:Node","scale_factor":1,"type":"#F44336","size":[55,55],"position":[0,0]},{"id":166,"properties":{"epa_label":"nan","uri_class":"Setting","uri_root":"nan/","id":"setting","class":"Setting","label":"Setting:Nan:Node"},"color":"#2196F3","styles":{},"label":"Setting:Nan:Node","scale_factor":1,"type":"#2196F3","size":[55,55],"position":[0,0]},{"id":171,"properties":{"epa_label":"nan","uri_class":"ProcessStatement","uri_root":"nan/","id":"start","class":"ProcessStatement","label":"Processstatement:Nan:Node"},"color":"#607D8B","styles":{},"label":"Processstatement:Nan:Node","scale_factor":1,"type":"#607D8B","size":[55,55],"position":[0,0]}],"_overview":{"enabled":null,"overview_set":false},"_selected_graph":[[{"id":44,"properties":{"epa_label":"nan","uri_class":"oberservation.html","uri_root":"https://build.fhir.org/","id":"blood_pressure","class":"Observation","label":"Observation:Nan:Node"}}],[]],"_sidebar":{"enabled":true,"start_with":"About"},"_view_count":null,"_view_module":"yfiles-jupyter-graphs","_view_module_version":"^1.7.2","_view_name":"GraphView","layout":"IPY_MODEL_4e3772ae71fd4764a676eb6a5dbef286","tabbable":null,"tooltip":null}},"4e3772ae71fd4764a676eb6a5dbef286":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"2.0.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"2.0.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"2.0.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border_bottom":null,"border_left":null,"border_right":null,"border_top":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":"710px","justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"padding":null,"right":null,"top":null,"visibility":null,"width":"100%"}}}}},"nbformat":4,"nbformat_minor":5}